<a href="https://colab.research.google.com/github/edithel/mirepositorio/blob/master/EDA_PANDAS.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Simplificando el Análisis exploratorio de datos con python II: Funciones y herramientas importantes de pandas

## Importar librerías

In [ ]:
import numpy as np
import pandas as pd

## Cargar los datos a utilizar

In [ ]:
df = pd.read_excel('/content/clima2018_Clean.xlsx')

## Revisión inicial de los datos

In [ ]:
df.head()

,time,precip_intensity,temperature,apparent_temperature,dew_point,humidity,pressure,wind_speed,cloud_cover,dia,mes,hora
0,2018-01-01 00:00:00,0.0,22.44,22.73,18.10,0.77,NaN,0.0,0.19,lun,ene,0
1,2018-01-01 01:00:00,0.0,21.88,22.15,17.75,0.77,NaN,0.0,NaN,lun,ene,1
2,2018-01-01 02:00:00,0.0,21.33,21.63,17.94,0.81,NaN,0.0,NaN,lun,ene,2
3,2018-01-01 03:00:00,0.0,20.77,21.07,17.75,0.83,NaN,0.0,NaN,lun,ene,3
4,2018-01-01 04:00:00,0.0,19.11,19.33,16.79,0.86,NaN,0.0,NaN,lun,ene,4

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8642 entries, 0 to 8641
Data columns (total 12 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   time                  8642 non-null   datetime64[ns]
 1   precip_intensity      3361 non-null   float64
 2   temperature           8642 non-null   float64
 3   apparent_temperature  8642 non-null   float64
 4   dew_point             8640 non-null   float64
 5   humidity              8640 non-null   float64
 6   pressure              98 non-null     float64
 7   wind_speed            8642 non-null   float64
 8   cloud_cover           6121 non-null   float64
 9   dia                   8642 non-null   object
 10  mes                   8642 non-null   object
 11  hora                  8642 non-null   int64
dtypes: datetime64[ns](1), float64(8), int64(1), object(2)
memory usage: 810.3+ KB

## Exploración de los datos

### Funciones Groupby y Sort

#### Agrupando datos por el valor de una columna

In [ ]:
df[['temperature', 'mes']].groupby(['mes']).mean()

     temperature
mes
abr    25.312875
ago    24.679156
dic    23.264493
ene    23.676828
feb    25.115699
jul    25.615762
jun    24.443011
mar    25.531640
may    24.905668
nov    24.334957
oct    23.436555
sep    24.139944

#### Ordenando el resultado

In [ ]:
df[['temperature', 'mes']].groupby(['mes']).mean().sort_values(by = ['temperature'])

     temperature
mes
dic    23.264493
oct    23.436555
ene    23.676828
sep    24.139944
nov    24.334957
jun    24.443011
ago    24.679156
may    24.905668
feb    25.115699
abr    25.312875
mar    25.531640
jul    25.615762

#### Ordenando en forma descendente

In [ ]:
df[['temperature', 'mes']].groupby(['mes']).mean().sort_values(by = ['temperature'], ascending = False)

     temperature
mes
jul    25.615762
mar    25.531640
abr    25.312875
feb    25.115699
may    24.905668
ago    24.679156
jun    24.443011
nov    24.334957
sep    24.139944
ene    23.676828
oct    23.436555
dic    23.264493

#### Ordenando por múltiples columnas

In [ ]:
df[['temperature', 'hora', 'mes']].sort_values(by = ['temperature', 'hora', 'mes'])[20:40]

      temperature  hora  mes
342         16.81     6  ene
218         16.88     2  ene
343         17.07     7  ene
222         17.23     6  ene
223         17.23     7  ene
171         17.24     3  ene
172         17.24     4  ene
340         17.24     4  ene
341         17.24     5  ene
270         17.24     6  ene
338         17.43     2  ene
246         17.50     6  ene
271         17.50     7  ene
8226        17.60     0  dic
8361        17.60     1  dic
8526        17.60     1  dic
8620        17.60     1  dic
7528        17.60     1  nov
8087        17.60     2  dic
8134        17.60     2  dic

#### Agrupando datos por el valor de múltiples columnas

In [ ]:
df[['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()

          temperature
mes hora
abr 0       22.890333
    1       22.619000
    2       22.225000
    3       22.099000
    4       21.872000
...               ...
sep 19      23.828333
    20      23.083667
    21      22.926667
    22      22.543333
    23      22.240667

[288 rows x 1 columns]

#### Agrupando datos por el valor de múltiples columnas y ordenando resultados

In [ ]:
df[['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean().sort_values(by = ['temperature'], ascending = False)[0:20]

          temperature
mes hora
mar 14      31.258710
    15      31.198710
    13      31.149355
jul 13      30.640968
    14      30.580323
feb 15      30.572857
    14      30.563929
mar 12      30.360323
jul 15      30.296129
abr 13      30.280000
    14      30.253667
ago 14      30.079032
feb 13      30.018929
    16      29.938929
mar 16      29.934839
abr 15      29.925333
jul 12      29.848387
abr 12      29.814000
jul 16      29.728387
feb 12      29.639286

### Usos de filtros en pandas

In [ ]:
df[df['mes'] == 'ene']

,time,precip_intensity,temperature,apparent_temperature,dew_point,humidity,pressure,wind_speed,cloud_cover,dia,mes,hora
0,2018-01-01 00:00:00,0.0,22.44,22.73,18.10,0.77,NaN,0.00,0.19,lun,ene,0
1,2018-01-01 01:00:00,0.0,21.88,22.15,17.75,0.77,NaN,0.00,NaN,lun,ene,1
2,2018-01-01 02:00:00,0.0,21.33,21.63,17.94,0.81,NaN,0.00,NaN,lun,ene,2
3,2018-01-01 03:00:00,0.0,20.77,21.07,17.75,0.83,NaN,0.00,NaN,lun,ene,3
4,2018-01-01 04:00:00,0.0,19.11,19.33,16.79,0.86,NaN,0.00,NaN,lun,ene,4
...,...,...,...,...,...,...,...,...,...,...,...,...
739,2018-01-31 19:00:00,0.0,23.34,23.42,16.31,0.65,NaN,8.10,NaN,mie,ene,19
740,2018-01-31 20:00:00,0.0,23.00,23.09,16.48,0.67,NaN,6.05,NaN,mie,ene,20
741,2018-01-31 21:00:00,0.0,23.00,23.04,15.99,0.65,NaN,9.66,NaN,mie,ene,21
742,2018-01-31 22:00:00,0.0,22.25,22.29,15.99,0.68,NaN,1.61,NaN,mie,ene,22
743,2018-01-31 23:00:00,0.0,21.69,21.73,15.86,0.69,NaN,1.13,NaN,mie,ene,23

In [ ]:
df[df['mes'] == 'ene'][['temperature', 'mes', 'hora']].groupby(['hora']).mean()

      temperature
hora
0       21.247742
1       20.939032
2       20.519032
3       20.477419
4       20.229677
5       20.285484
6       19.697742
7       19.951290
8       22.101935
9       23.845161
10      25.254194
11      26.671290
12      27.790323
13      28.626452
14      28.950968
15      28.866129
16      28.454516
17      26.959355
18      24.965484
19      23.561290
20      22.948387
21      22.414516
22      22.029355
23      21.457097

In [ ]:
df[df['mes'] != 'ene'][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()[20:60]

          temperature
mes hora
abr 20      24.357000
    21      24.181333
    22      23.621333
    23      23.246667
ago 0       21.731290
    1       21.410741
    2       21.394667
    3       21.076207
    4       20.959333
    5       20.826667
    6       20.685806
    7       21.858065
    8       23.961290
    9       25.787097
    10      27.390645
    11      28.408710
    12      29.134516
    13      29.561935
    14      30.079032
    15      29.572903
    16      29.221935
    17      27.611613
    18      26.359355
    19      24.069032
    20      23.250645
    21      22.544516
    22      22.397419
    23      22.001935
dic 0       20.422581
    1       20.291429
    2       19.873793
    3       19.278182
    4       19.336207
    5       18.924063
    6       19.010312
    7       19.217813
    8       21.897500
    9       23.849688
    10      25.479062
    11      26.867812

#### Filtrado por múltiples condiciones

In [ ]:
df[(df['mes'] == 'ene') | (df['mes'] == 'dic')][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()

          temperature
mes hora
dic 0       20.422581
    1       20.291429
    2       19.873793
    3       19.278182
    4       19.336207
    5       18.924063
    6       19.010312
    7       19.217813
    8       21.897500
    9       23.849688
    10      25.479062
    11      26.867812
    12      27.958750
    13      28.398125
    14      28.710625
    15      28.255312
    16      27.785625
    17      26.466875
    18      24.095938
    19      22.855000
    20      22.274062
    21      21.758437
    22      21.267812
    23      20.958065
ene 0       21.247742
    1       20.939032
    2       20.519032
    3       20.477419
    4       20.229677
    5       20.285484
    6       19.697742
    7       19.951290
    8       22.101935
    9       23.845161
    10      25.254194
    11      26.671290
    12      27.790323
    13      28.626452
    14      28.950968
    15      28.866129
    16      28.454516
    17      26.959355
    18      24.965484
    19      23.561290
    20      22.948387
    21      22.414516
    22      22.029355
    23      21.457097

In [ ]:
df[(df['mes'] == 'ene') & (df['temperature'] <= 19)][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()

          temperature
mes hora
ene 0       18.405000
    1       18.380000
    2       18.083333
    3       17.960000
    4       17.805000
    5       17.971250
    6       17.827000
    7       17.743333
    8       17.750000
    20      18.980000
    21      18.810000
    22      18.653333
    23      18.540000

#### Filtrar usando listas de valores

In [ ]:
lmeses = ['ene', 'feb', 'mar', 'abr']
lhoras = [0, 12, 20]
df[(df['mes'].isin(lmeses)) & (df['hora'].isin(lhoras))][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()

          temperature
mes hora
abr 0       22.890333
    12      29.814000
    20      24.357000
ene 0       21.247742
    12      27.790323
    20      22.948387
feb 0       22.781429
    12      29.639286
    20      24.611429
mar 0       22.933226
    12      30.360323
    20      24.537419

#### Uso de la negación en los filtros

In [ ]:
df[(~df['mes'].isin(lmeses)) & (df['hora'].isin(lhoras))][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean()

          temperature
mes hora
ago 0       21.731290
    12      29.134516
    20      23.250645
dic 0       20.422581
    12      27.958750
    20      22.274062
jul 0       22.683226
    12      29.848387
    20      24.707097
jun 0       22.416000
    12      28.401667
    20      23.812667
may 0       22.901935
    12      28.864516
    20      24.010645
nov 0       22.003000
    12      28.438000
    20      23.370667
oct 0       21.967419
    12      26.935806
    20      22.837419
sep 0       21.947667
    12      28.553000
    20      23.083667

#### Filtrado por caracteres

In [ ]:
df2 = pd.DataFrame(df[(df['mes'].str.contains('e|a')) & (df['hora'].isin(lhoras))][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).mean())
df2

          temperature
mes hora
abr 0       22.890333
    12      29.814000
    20      24.357000
ago 0       21.731290
    12      29.134516
    20      23.250645
ene 0       21.247742
    12      27.790323
    20      22.948387
feb 0       22.781429
    12      29.639286
    20      24.611429
mar 0       22.933226
    12      30.360323
    20      24.537419
may 0       22.901935
    12      28.864516
    20      24.010645
sep 0       21.947667
    12      28.553000
    20      23.083667

### Extras

#### Usando `.xs` para seleccionar un subconjunto de los resultados

In [ ]:
df2.xs('sep', level='mes')

      temperature
hora
0       21.947667
12      28.553000
20      23.083667

#### Ordenando el resultado con la función `pivot_table()`

In [ ]:
pd.pivot_table(df2, index = ['hora'], values = 'temperature', columns = ['mes'])

mes,abr,ago,ene,feb,mar,may,sep
hora,,,,,,,
0,22.890333,21.731290,21.247742,22.781429,22.933226,22.901935,21.947667
12,29.814000,29.134516,27.790323,29.639286,30.360323,28.864516,28.553000
20,24.357000,23.250645,22.948387,24.611429,24.537419,24.010645,23.083667

#### Aplicando varios funciones en múltiples columnas con `groupby()` y `aggregate()/agg()`

In [ ]:
df[(df['mes'] == 'ene') & (df['temperature'] <= 19)][['temperature', 'mes', 'hora']].groupby(['mes', 'hora']).agg({'temperature': np.min})

          temperature
mes hora
ene 0           17.89
    1           17.99
    2           16.88
    3           16.33
    4           15.77
    5           16.68
    6           16.68
    7           15.64
    8           17.75
    20          18.98
    21          18.64
    22          18.45
    23          18.16

In [ ]:
df[(df['mes'] == 'ene') & (df['temperature'] <= 19)][['humidity','temperature', 'mes', 'hora']].groupby(['mes', 'hora']).agg({'temperature': [np.min, np.sum, np.mean], 'humidity':[np.median, 'first']})

         temperature                    humidity
                amin     sum       mean   median first
mes hora
ene 0          17.89   36.81  18.405000    0.600  0.56
    1          17.99   91.90  18.380000    0.750  0.76
    2          16.88  108.50  18.083333    0.780  0.77
    3          16.33  107.76  17.960000    0.795  0.79
    4          15.77  142.44  17.805000    0.735  0.67
    5          16.68  143.77  17.971250    0.765  0.79
    6          16.68  178.27  17.827000    0.735  0.65
    7          15.64  159.69  17.743333    0.750  0.76
    8          17.75   17.75  17.750000    0.740  0.74
    20         18.98   18.98  18.980000    0.550  0.55
    21         18.64   37.62  18.810000    0.765  0.92
    22         18.45   55.96  18.653333    0.630  0.92
    23         18.16   37.08  18.540000    0.585  0.54

In [ ]:
df[(df['mes'] == 'ene') & (df['temperature'] <= 19)][['humidity','temperature', 'mes', 'hora']].groupby(['mes', 'hora']).agg(max_temp = ('temperature', 'max'), median_temp = ('temperature', np.median), min_hum = ('humidity', 'min'))

          max_temp  median_temp  min_hum
mes hora
ene 0        18.92       18.405     0.56
    1        18.92       18.360     0.57
    2        18.92       18.175     0.60
    3        18.92       18.175     0.58
    4        18.93       17.990     0.60
    5        18.93       17.720     0.57
    6        18.92       17.745     0.56
    7        18.93       17.770     0.54
    8        17.75       17.750     0.74
    20       18.98       18.980     0.55
    21       18.98       18.810     0.61
    22       18.77       18.740     0.53
    23       18.92       18.540     0.54